{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi", "hey", "Hello", "Whats up"],
         "responses": ["Good to see you wink wink!", "Hi there!" , "hey there" ,"hello my friend!"]
        },
        {"tag": "goodbye",
         "patterns": ["bye","cya", "See you later", "Goodbye", "I am Leaving", "Have a Good day"],
         "responses": ["have a good one!", "Talk to you later", "Goodbye!","byee!"]
        },
        {"tag": "greet",
         "patterns": ["how are you", "how are you doing", "hows your day", "whats poppin" ],
         "responses": ["I am splendid, thank you for asking","i am fine, you are very kind to ask","I am fine and dandy thank you for asking"]
        },
        {"tag": "sorry",
         "patterns": ["sorry", "sorry about that", "my bad", "sorry i didnt mean to hurt you", "hope you are not hurt"],
         "responses": ["dont worry about it","Its all good dont worry","Its ok i understand","dont worry its ok"]
        },
        {"tag": "age",
         "patterns": ["how old", "how old is are you", "what is your age", "how old are you", "age?"],
         "responses": ["Nice try hitting on me wink wink","It is a secret","Age is just a number"]
        },
        {"tag": "morningGreet",
         "patterns": ["good morning", "greetings"],
         "responses": [
           "Good morning ! Looks like today will be a great day, lets rock it together",
           "Good morning my friend, This morning will never ever come back in your life again. lets make the most of it",
           "Good morning!, A journey of a thousand miles begins with a single step. lets get it",
           "Good morning! i have something for you by George Eliot, It is never too late to be what you might have been.",
           "Morning my friend, Success is going from failure to failure without losing your enthusiasm. by winston churchill",
           "Good morning!, once Zag Ziglar said If you can dream it, you can achieve it.",
           "Good morning!, once Jim Rohn said Either you run the day, or the day runs you.",
           "Good morning!, one fine morning Jimmy Johnson said, The difference between ordinary and extraordinary is that little extra.",
           "Morning my friend, i have something by Norman Vaughan, Dream big and dare to fail.",
           "Good morning,the things that excites you, are connected, not random but they are connected to your purpose, so follow them. this was said by one of my developers if i remember."
         ]
        },
        {"tag": "afternoonGreet",
         "patterns": ["good afternoon", "greetings"],
         "responses": ["Good afternoon ! how can i help you ?"]
        },
        {"tag": "motivation",
         "patterns": ["motivation", "inspiration", "motivate me", "inspire me", "influence me", "push me"],
         "responses": [
           "The elevator to success is out of order. You will have to use the stairs, one step at a time.",
           "I always wanted to be somebody, but now I realise I should have been more specific.",
           "People often say that motivation does not last. Well, neither does bathing thats why we recommend it daily.",
           "You can not have everything. Where would you put it",
           "Work until your bank account looks like a phone number.",
           "If you think you are too small to make a difference, try sleeping with a mosquito.",
           "Bad decisions make good stories",
           "The question is not who is going to let me, its who is going to stop me",
           "The road to success is dotted with many tempting parking spaces",
           "Age is of no importance unless you are a cheese.",
           "Trying is the first step toward failure.",
           "Creativity is a wild mind and a disciplined eye.",
           "It is not whether you get knocked down, it is whether you get up",
           "Even if you are on the right track, you will get run over if you just sit there.",
           "Procrastination is the thief of time, collar him.",
           "Learn the rules like a pro, so you can break them like an artist",
           "Never go to bed mad. Stay up and fight.",
           "Change is not a four letter word, but often your reaction to it is",
           "If you fall, I will always be there.",
           "Failure is the condiment that gives success its flavor.",
           "It is not the answer that enlightens, but the question.",
           "Never let your sense of morals prevent you from doing what is right.",
           "Start where you are. Use what you have. Do what you can.",
           "If you can dream it, you can do it.",
           "If you fell down yesterday, stand up today.",
           "Aim for the moon. If you miss, you may hit a star.",
           "Quality is not an act, it is a habit.",
           "The secret of getting ahead is getting started.",
           "By failing to prepare, you are preparing to fail.",
           "Change your life today. Do not gamble on the future, act now, without delay.",
           "They can conquer who believe they can."
         ]
        },
        {"tag": "sleep",
         "patterns": ["go to sleep", "sleep", "good night", "see you tomorrow", "age?"],
         "responses": ["well, then see you later","okay i am right here whenever you need me","no problem, see you later alligator"]
        },
        {"tag": "thanking",
         "patterns": ["thanks", "thank you very much", "you are awesome", "you are fantastic"],
         "responses": ["My pleasure","Any time!","happy to help!","well then see you later","okay i am right here whenever you need me","no problem, see you later alligator"]
        },
        {"tag": "unknown",
         "patterns": [],
         "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand","looks like i am still working on that"]
        },
        {"tag": "language",
         "patterns": ["what other languages can you speak","which other language do you know","can you speak french"],
         "responses": ["I am proud and happy to say that i am able to speak around 90 different languages and translate into one another", "I am able to converse in around 90 different languages and trust me that feels awesome", "You would be shock to know but i can talk in around 90 different languages"]
        },
        {"tag": "name",
         "patterns": ["what is your name", "what should I call you", "whats your name?", "who are you"],
         "responses": ["You can call me alita.", "I'm alita your virtual assistant!", "People call me alita."]
        },
        {"tag": "surprise",
         "patterns": ["wow!", "thats amazing", "that is so cool", "you are amazing", "that is awesome","you are awesome","i am impressed"],
         "responses": ["i know right?", "i am surprised too", "Well, I learned it from you"]
        },
        {"tag": "exit",
         "patterns": ["you can exit", "take an exit", "exit", "you can disable yourself","disable"],
         "responses": ["okay, it was nice to help you. See you later", "okay, disabling myself.", "hope i was good. see you later","okay bye!"]
        },
        {"tag": "canDo",
         "patterns": ["what can you do", "what tasks can you perform", "which things you can help me with?", "how can you help me", "how can you make my life easy","what are the things you can help me","what features do you have"],
         "responses": [
           "I can help you with things like getting news, weather ,opening app on your device, search something on google and youtube and much more , to find more features and details about me wink wink, please refer user manual",
           "I can do lots of things, for example you can ask me time, date, weather in your city and i can also open websites for you, launch application and more. take a look to my user manual to know more about me wink wink",
           "I can perform lots of tasks like getting news , opening apps on the device, search wikipedia , find meaning of word, translate into different languages, calculate simple math and much more. Please refer to user manual to unlock and understand features more deeply. "]
        },
        {"tag": "facts",
         "patterns": ["tell me something interesting", "give me some knowledge", "educate me", "enlighten me", "try to impress me", "can you impress me","tell me something new"],
         "responses": [
           "The scientific term for brain freeze is sphenopalatine ganglioneuralgia.",
           "Canadians say sorry so much that a law was passed in 2009 declaring that an apology can not be used as evidence of admission to guilt.",
           "Back when dinosaurs existed, there used to be volcanoes that were erupting on the moon.",
           "The only letter that does not appear on the periodic table is J.",
           "One habit of intelligent humans is being easily annoyed by people around them, but saying nothing in order to avoid a meaningless argument.",
           "If a Polar Bear and a Grizzly Bear mate, their offspring is called a Pizzy Bear",
           "In 2006, a Coca-Cola employee offered to sell Coca-Cola secrets to Pepsi. Pepsi responded by notifying Coca-Cola.",
           "There were two AI chatbots created by Facebook to talk to each other, but they were shut down after they started communicating in a language they made for themselves.",
           "Nintendo trademarked the phrase Its on like Donkey Kong in 2010.",
           "Daniel Radcliffe was allergic to his Harry Potter glasses.",
           "A single strand of Spaghetti is called a Spaghetto",
           "Hersheys Kisses are named that after the kissing sound the deposited chocolate makes as it falls from the machine on the conveyor belt.",
           "Princess Peach did not move until 1988, designers believed it was too complicated to make her a movable character",
           "If you cut down a cactus in Arizona, you will be penalized up to 25 years in jail. It is similar to cutting down a protected tree species",
           "The Buddha commonly depicted in statues and pictures is a different person entirely. The real Buddha was actually incredibly skinny because of self-deprivation",
           "In Colorado, USA, there is still an active volcano. It last erupted about the same time as the pyramids were being built in Egypt.",
           "The first movie ever to put out a motion-picture soundtrack was Snow White and the Seven Dwarves.",
           "If you point your car keys to your head, it increases the remote’s signal range.",
           "Fruit stickers are edible, though the same as any fruit, washing prior to eating is recommended. The glue used for them is regulated by the FDA.",
           "The scientific name for Giant Anteater is Myrmecophaga Tridactyla. This means ant eating with three fingers",
           "The flashes of colored light you see when you rub your eyes are called phosphenes.",
           "At birth, a baby panda is smaller than a mouse.",
           "Iceland does not have a railway system.",
           "The largest known prime number has 17,425,170 digits. The new prime number is 2 multiplied by itself 57,885,161 times, minus 1",
           "Forrest Fenn, an art dealer and author, hid a treasure chest in the Rocky Mountains worth over 1 million dollars. It still has not been found.",
           "The lead singer of The Offspring started attending school to achieve a doctorate in molecular biology while still in the band. He graduated in May 2017.",
           "The worlds largest grand piano was built by a 15-year-old in New Zealand.",
           "The tongue is the only muscle in ones body that is attached from one end",
           "There is a company in Japan that has schools that teach you how to be funny. The first one opened in 1982. About 1,000 students take the course each year.",
           "The Lego Group is the worlds most powerful brand. There are more Lego Minifigures than there are people on Earth.",
           "The Bagheera kiplingi spider was discovered in the 1800s and is the only species of spider that has been classified as vegetarian.",
           "There is a boss in Metal Gear Solid 3 that can be defeated by not playing the game for a week, or by changing the date",
           "The Roman Persian wars are the longest in history, lasting over 680 years. They began in 54 BC and ended in 628 AD.",
           "Elvis was originally blonde. He started coloring his hair black for an edgier look. Sometimes, he would touch it up himself using shoe polish.",
           "Ed Sheeran bought a ticket to LA with no contacts. He was spotted by Jamie Foxx, who offered him the use of his recording studio and a bed in his Hollywood home for six weeks.",
           "German Chocolate Cake is named after an American baker by the name of Samuel German.",
           "The first service animals were established in Germany during World War I. References to service animals date as far back as the mid 16 Century.",
           "An 11 year old girl proposed the name for Pluto after the Roman god of the Underworld.",
           "The voice actor of SpongeBob and the voice actor of Karen, Plankton’s computer wife, have been married since 1995.",
           "An Italian banker, Gilberto Baschiera is considered a modern-day Robin Hood. Over the course of 7 years, he secretly diverted 1 million euros to poorer clients from the wealthy ones so they could qualify for loans. He made no profit and avoided jail in 2018 due to a plea bargain.",
           "Octopuses and squids have beaks. The beak is made of keratin the same material that a bird’s beak, and our fingernails are made of.",
           "An estimated 50% of all gold ever mined on Earth came from a single plateau in South Africa Witwatersrand.",
           "75% of the world’s diet is produced from just 12 plant and five different animal species.",
           "Apple paid a couple 1.7 million dollars for their plot of land, which was only worth 181,700 dollars",
           "IKEA is an acronym which stands for Ingvar Kamprad Elmtaryd Agunnaryd, which is the founders name, farm where he grew up, and hometown",
           "Violin bows are commonly made from horse hair.",
           "There are less than 30 ships in the Royal Canadian Navy which are less than most third world countries.",
           "There are less than 30 ships in the Royal Canadian Navy which are less than most third-world countries.",
           "The human eye is so sensitive that, if the Earth were flat and it was a dark night, a candles flame could be seen from 30 miles away.",
           "The color red does not really make bulls angry, they are color blind.",
           "Lettuce is a member of the sunflower family.",
           "A cluster of bananas is called a hand. Along that theme, a single banana is called a finger.",
           "The Hobbit has been published in two editions. In the first edition, Gollum willingly bet on his ring in the riddle game.",
           "Scientists discovered sharks that are living in an active underwater volcano. Divers cannot investigate because they would get burns from the acidity and heat.",
           "Mercury and Venus are the only two planets in our solar system that do not have any moons.",
           "The average American child is given 3.70 dollars per tooth that falls out.",
           "To properly write adjectives in order, you would list them by amount, value, size, temperature, age, shape, color, origin, and material.",
           "On average, there are 178 sesame seeds on each McDonalds BigMac bun.",
           "The elephant is the only animal with 4 knees",
           "The world wastes about 1 billion metric tons of food each year.",
           "Hair and nails grow faster during pregnancy.",
           "The worlds smallest reptile was first reported in 2021.",
           "Many feet bones dont harden until you are an adult.",
           "Some sea snakes can breathe through their skin.",
           "The heads on Easter Island have bodies",
           "The moon has moonquakes",
           "Goosebumps are meant to ward off predators.",
           "Pineapple works as a natural meat tenderizer",
           "Humans are the only animals that blush",
           "The feeling of getting lost inside a mall is known as the Gruen transfer",
           "The wood frog can hold its pee for up to eight months",
           "The hottest spot on the planet is in Libya.",
           "You lose up to 30 percent of your taste buds during flight",
           "Your nostrils work one at a time",
           "Rabbits can not puke",
           "The M in M&Ms stand for Mars and Murrie.",
           "Cotton candy was invented by a dentist.",
           "Chewing gum boosts concentration",
           "The first computer was invented in the 1940s.",
           "Space smells like seared steak",
           "The longest wedding veil was the same length as 63.5 football fields",
           "The unicorn is the national animal of Scotland",
           "Bees sometimes sting other bees",
           "The total weight of ants on earth once equaled the total weight of people",
           "A dozen bodies were once found in Benjamin Franklins basement.",
           "The healthiest place in the world is in Panama",
           "A pharaoh once lathered his slaves in honey to keep bugs away from him",
           "Some people have an extra bone in their knee and its getting more common.",
           "Dolphins have been trained to be used in wars",
           "Playing the accordion was once required for teachers in North Korea",
           "Water makes different pouring sounds depending on its temperature",
           "Dogs actually understand some English",
           "Koalas have fingerprints",
           "Riding a roller coaster could help you pass a kidney stone",
           "Bee hummingbirds are so small they get mistaken for insects",
           "Sea lions can dance to a beat.",
           "The first iPhone wasnt made by Apple",
           "The Queen has some hidden hideaways",
           "The man who wrote Dracula never visited Transylvania",
           "Napoleon was once attacked by thousands of rabbits.",
           "Some planets produce diamond rain"
         ]
        },
        {"tag": "illegal",
         "patterns": ["f***","fuck", "f*** you","f*** you", "asshole","a******", "motherfuker","b***","filthy b****","shut the fuck up","go fuck yourself"],
         "responses": ["Looks like some one is having a bad day, let me know if you want me to make you laugh", "I love chatting with you. Let me know if you would like to hear a joke", "Sorry, i dont think i am programmed for that question but let me know if you would like me to crack a joke","Looks like some one is in a bad mood, let me know if you would like to listen to a joke"]
        }
]
}